import Cluster from './types/Cluster'

const data: Cluster = {
  name: 'Cluster',
  children: [
    {
    "id": 0,
    "name": "รักษา ฟรี ไทย บาท 30 โรค",
    "value": 1.56
    },
    {
    "id": 1,
    "name": "กู้ยืม ล้าน บาท กองทุน 10,000 sme",
    "value": 4.36
    },
    {
    "id": 2,
    "name": "บัตร เครดิตบูโร ประชาชน ปฏิรูป ตำรวจ จังหวัด",
    "value": 8.1
    },
    {
    "id": 3,
    "name": "ปี อายุ ประชา ขยาย รัฐ",
    "value": 5.92
    },
    {
    "id": 4,
    "name": "ภาษี 10 บุคคลธรรมดา บาท ค่า ลด งบ กระทรวงกลาโหม",
    "value": 2.8
    },
    {
    "id": 5,
    "name": "อำเภอ กีฬา ทักษะ พัฒนา",
    "value": 4.67
    },
    {
    "id": 6,
    "name": "พลังงาน สวัสดิการ ท้องถิ่น ชุมชน โฉนด",
    "value": 3.43
    },
    {
    "id": 7,
    "name": "ยังชีพ เบี้ย ผู้สูงอายุ บาท เดือน",
    "value": 5.61
    },
    {
    "id": 8,
    "name": "ทุจริต ยาเสพติด แก้ปัญหา คอรัปชั่น ปลอด ปราบปราม",
    "value": 2.8
    },
    {
    "id": 9,
    "name": "พื้นที่ หน่วยงาน เทคโนโลยี",
    "value": 2.49
    },
    {
    "id": 10,
    "name": "บาท สร้าง",
    "value": 19.63
    },
    {
    "id": 11,
    "name": "คนพิการ ทำ ธนาคาร ทุน ตำบล งาน",
    "value": 4.67
    },
    {
    "id": 12,
    "name": "กฎหมาย ศ. แก้ กย รถบรรทุก หนี้ ประมง",
    "value": 1.87
    },
    {
    "id": 13,
    "name": "การกีฬา การท่องเที่ยว ส่งเสริม พัฒนา",
    "value": 3.43
    },
    {
    "id": 14,
    "name": "ครู เดินหน้า ปฏิวัติ ขุด ไทย ธนาคาร คลอง ที่ดิน การศึกษา",
    "value": 3.43
    },
    {
    "id": 15,
    "name": "ปี พัก แก้ปัญหา หนี้ เกษตรกร กองทุน",
    "value": 3.12
    },
    {
    "id": 16,
    "name": "รายได้ การเกษตร เกษตรกร ลด",
    "value": 4.05
    },
    {
    "id": 17,
    "name": "พิเศษ พัฒนา ชายแดน ทำ ท้องถิ่น ประเทศ องค์กร จังหวัด",
    "value": 2.8
    },
    {
    "id": 18,
    "name": "ซื้อ รถโดยสาร อาวุธ รถเมล์ ไฟฟ้า กองทัพ งบ",
    "value": 1.56
    },
    {
    "id": 19,
    "name": "เศรษฐกิจ ส่งเสริม สิทธิ พื้นที่ แก้ไขปัญหา",
    "value": 4.05
    },
    {
    "id": 20,
    "name": "สมัครใจ สงคราม ยกเว้น ยกเลิก ระบบ",
    "value": 4.67
    },
    {
    "id": 21,
    "name": "กิน ทำ กรรมสิทธิ์ รัฐ ที่ดิน จัดสรร",
    "value": 2.8
    },
    {
    "id": 22,
    "name": "โครงการ มอเตอร์เวย์ ดอกไม้ รถไฟ ราง เร่ง คู่",
    "value": 2.18
    }
    ],
  findIndex: function (arg0: (item: any, i: any) => boolean): unknown {
    throw new Error('Function not implemented.');
  }
};
  
  export default data;