import Cluster from './types/Cluster'

const data: Cluster = {
  name: 'Cluster',
  children: [
    {
      "id": 0,
      "name": "รักษา 30 ฟรี โรค บาท ไทย",
      "value": 5
    },
    {
      "id": 1,
      "name": "sme ล้าน กองทุน กู้ยืม 10,000 บาท",
      "value": 14
    },
    {
      "id": 2,
      "name": "เครดิตบูโร ปฏิรูป ประชาชน ตำรวจ จังหวัด บัตร",
      "value": 26
    },
    {
      "id": 3,
      "name": "ประชา ปี ขยาย อายุ รัฐ",
      "value": 19
    },
    {
      "id": 4,
      "name": "ภาษี 10 บุคคลธรรมดา ลด กระทรวงกลาโหม บาท ค่า งบ",
      "value": 9
    },
    {
      "id": 5,
      "name": "พัฒนา กีฬา อำเภอ ทักษะ",
      "value": 15
    },
    {
      "id": 6,
      "name": "พลังงาน สวัสดิการ โฉนด ท้องถิ่น ชุมชน",
      "value": 11
    },
    {
      "id": 7,
      "name": "ยังชีพ เดือน เบี้ย ผู้สูงอายุ บาท",
      "value": 18
    },
    {
      "id": 8,
      "name": "ปลอด คอรัปชั่น แก้ปัญหา ยาเสพติด ทุจริต ปราบปราม",
      "value": 9
    },
    {
      "id": 9,
      "name": "เทคโนโลยี พื้นที่ หน่วยงาน",
      "value": 8
    },
    {
      "id": 10,
      "name": "สร้าง บาท",
      "value": 63
    },
    {
      "id": 11,
      "name": "คนพิการ ตำบล ทำ ทุน ธนาคาร งาน",
      "value": 15
    },
    {
      "id": 12,
      "name": "กย รถบรรทุก แก้ หนี้ กฎหมาย ประมง ศ.",
      "value": 6
    },
    {
      "id": 13,
      "name": "การท่องเที่ยว การกีฬา ส่งเสริม พัฒนา",
      "value": 11
    },
    {
      "id": 14,
      "name": "ปฏิวัติ เดินหน้า การศึกษา ครู คลอง ธนาคาร ขุด ที่ดิน ไทย",
      "value": 11
    },
    {
      "id": 15,
      "name": "พัก ปี กองทุน แก้ปัญหา หนี้ เกษตรกร",
      "value": 10
    },
    {
      "id": 16,
      "name": "ลด การเกษตร เกษตรกร รายได้",
      "value": 13
    },
    {
      "id": 17,
      "name": "พิเศษ ชายแดน ทำ พัฒนา องค์กร ประเทศ ท้องถิ่น จังหวัด",
      "value": 9
    },
    {
      "id": 18,
      "name": "อาวุธ ซื้อ รถเมล์ ไฟฟ้า รถโดยสาร กองทัพ งบ",
      "value": 5
    },
    {
      "id": 19,
      "name": "พื้นที่ แก้ไขปัญหา ส่งเสริม สิทธิ เศรษฐกิจ",
      "value": 13
    },
    {
      "id": 20,
      "name": "ยกเลิก สมัครใจ ยกเว้น ระบบ สงคราม",
      "value": 15
    },
    {
      "id": 21,
      "name": "ทำ จัดสรร กรรมสิทธิ์ กิน ที่ดิน รัฐ",
      "value": 9
    },
    {
      "id": 22,
      "name": "โครงการ เร่ง มอเตอร์เวย์ คู่ ดอกไม้ ราง รถไฟ",
      "value": 7
    }
  ],
  findIndex: function (arg0: (item: any, i: any) => boolean): unknown {
    throw new Error('Function not implemented.');
  }
};
  
  export default data;