import Cluster from './types/Cluster'

const data: Cluster = {

    name: 'Cluster',
    children: [
      {
          "name": "พื้นที่ แก้ไขปัญหา ทุจริต น้ำ กฎหมาย",
          "value": 14
      },
      {
          "name": "สมัครใจ ยกเลิก สงคราม ผู้สูงอายุ ยกเว้น ระบบ",
          "value": 10
      },
      {
          "name": "ทั่วประเทศ พัฒนา telemedicine ระบบ",
          "value": 18
      },
      {
          "name": "ธนาคาร ทำ ตำบล คนพิการ งาน ฟรี",
          "value": 19
      },
      {
          "name": "ยังชีพ บาท เดือน เบี้ย 2,000 ผู้สูงอายุ",
          "value": 21
      },
      {
          "name": "การท่องเที่ยว ท่องเที่ยว การกีฬา ส่งเสริม อุตสาหกรรม ยั่งยืน",
          "value": 11
      },
      {
          "name": "ปฏิรูป การศึกษา ไทย ลด ตำรวจ จังหวัด เครดิตบูโร",
          "value": 23
      },
      {
          "name": "สร้าง ทำงาน หยุด",
          "value": 16
      },
      {
          "name": "เรียน ท้องถิ่น ชุมชน ฟรี",
          "value": 16
      },
      {
          "name": "ขยายเวลา ราชการ 65 ขยาย ปี เกษียณ อายุ",
          "value": 7
      },
      {
          "name": "สร้าง startup ธุรกิจ ศูนย์ ส่งเสริม",
          "value": 20
      },
      {
          "name": "ชาวบ้าน เศรษฐกิจ แก้ปัญหา ปลอด ยาเสพติด จังหวัด",
          "value": 9
      },
      {
          "name": "รัฐ กิน ทำ จัดสรร ที่ดิน",
          "value": 10
      },
      {
          "name": "ธนาคาร ครู พิเศษ พัฒนา จังหวัด เขต เข้าถึง",
          "value": 8
      },
      {
          "name": "มูลค่า ประชาชน ยกเลิก ชุมชน โฉนด สปก.",
          "value": 15
      },
      {
          "name": "ซื้อ บาท อาวุธ งบ ลด 10 กองทัพ รถ",
          "value": 8
      },
      {
          "name": "สวัสดิการ ทหาร ลด ปฏิรูป เงินเดือน หยุด",
          "value": 10
      },
      {
          "name": "โรค รักษา ไทย ประจำตัว นโยบาย 30",
          "value": 15
      },
      {
          "name": "แก้ ศ. พัก ปรับโครงสร้าง กย หนี้ ปี เกษตรกร",
          "value": 10
      },
      {
          "name": "บาท สร้าง ล้าน กองทุน เกษตรกร",
          "value": 19
      },
      {
          "name": "รัฐ มารดา สวัสดิการ ล้างหนี้ ต่อยอด ประชา เครดิตบูโร บัตร",
          "value": 9
      },
      {
          "name": "ประจำ บาท อำเภอ 1,000,000 ลด 10 กิโลกรัม",
          "value": 23
      },
      {
          "name": "อินทรีย์ ทำ ดอกไม้ ประเทศ สปก. เกษตร",
          "value": 8
      }
  ]
  };
  
  export default data;